MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_timer6.c
/*!< Parameter valid check for match output status */
#define IS_VALID_MATCH_OUTPUT_STATUS(x) \
    ((Timer6PWMxCompareLow == (x)) ||   \
     (Timer6PWMxCompareHigh == (x)) ||  \
     (Timer6PWMxCompareKeep == (x)) ||  \
     (Timer6PWMxCompareInv == (x)))

/*!< Parameter valid check for port filter clock */
#define IS_VALID_PORT_FILTER_CLOCK(x)   \
    ((Timer6FltClkPclk0Div1 == (x)) ||  \
     (Timer6FltClkPclk0Div4 == (x)) ||  \
     (Timer6FltClkPclk0Div16 == (x)) || \
     (Timer6FltClkPclk0Div64 == (x)))

/*!< Parameter valid check for interrupt request source */
#define IS_VALID_VPERR_PCNT_NUM(x) \
    ((Timer6PeriodCnts0 == (x)) || \
     (Timer6PeriodCnts1 == (x)) || \
     (Timer6PeriodCnts2 == (x)) || \
     (Timer6PeriodCnts3 == (x)) || \
     (Timer6PeriodCnts4 == (x)) || \
     (Timer6PeriodCnts5 == (x)) || \
     (Timer6PeriodCnts6 == (x)) || \
     (Timer6PeriodCnts7 == (x)))
/*!< Parameter valid check for interrupt request source */
#define IS_VALID_VPERR_PCNT_EN_SOURCE(x) \
    ((Timer6PeriodCnteDisable == (x)) || \
     (Timer6PeriodCnteMin == (x)) ||     \
     (Timer6PeriodCnteMax == (x)) ||     \
     (Timer6PeriodCnteBoth == (x)))

/*!< Parameter valid check for interrupt request source */
#define IS_VALID_IRQ_SOURCE(x)  \
    ((Timer6INTENA == (x)) ||   \
     (Timer6INTENB == (x)) ||   \
     (Timer6INTENC == (x)) ||   \
     (Timer6INTEND == (x)) ||   \
     (Timer6INTENE == (x)) ||   \
     (Timer6INTENF == (x)) ||   \
     (Timer6INTENOVF == (x)) || \
     (Timer6INTENUDF == (x)) || \
     (Timer6INTENDTE == (x)) || \
     (Timer6INTENSAU == (x)) || \
     (Timer6INTENSAD == (x)) || \
     (Timer6INTENSBU == (x)) || \
     (Timer6INTENSBD == (x)))

/*!< Parameter valid check for status type */
#define IS_VALID_STATUS_TYPE(x) \
    ((Timer6CMAF == (x)) ||     \
     (Timer6CMBF == (x)) ||     \
     (Timer6CMCF == (x)) ||     \
     (Timer6CMDF == (x)) ||     \
     (Timer6CMEF == (x)) ||     \
     (Timer6CMFF == (x)) ||     \
     (Timer6OVFF == (x)) ||     \
     (Timer6UDFF == (x)) ||     \
     (Timer6DTEF == (x)) ||     \
     (Timer6CMSAUF == (x)) ||   \
     (Timer6CMSADF == (x)) ||   \
     (Timer6CMSBUF == (x)) ||   \
     (Timer6CMSBDF == (x)) ||   \
     (Timer6VPERNUM == (x)) ||  \
     (Timer6DIRF == (x)))

/*!< Parameter valid check for hardware up count/down count event type */
#define IS_VALID_HW_COUNT_TYPE(x)            \
    ((Timer6HwCntPWMALowPWMBRise == (x)) ||  \
     (Timer6HwCntPWMALowPWMBFall == (x)) ||  \
     (Timer6HwCntPWMAHighPWMBRise == (x)) || \
     (Timer6HwCntPWMAHighPWMBFall == (x)) || \
     (Timer6HwCntPWMBLowPWMARise == (x)) ||  \
     (Timer6HwCntPWMBLowPWMAFall == (x)) ||  \
     (Timer6HwCntPWMBHighPWMARise == (x)) || \
     (Timer6HwCntPWMBHighPWMAFall == (x)) || \
     (Timer6HwCntTRIGARise == (x)) ||        \
     (Timer6HwCntTRIGAFall == (x)) ||        \
     (Timer6HwCntTRIGBRise == (x)) ||        \
     (Timer6HwCntTRIGBFall == (x)) ||        \
     (Timer6HwCntAos0 == (x)) ||             \
     (Timer6HwCntAos1 == (x)))

/*!< Parameter valid check for hardware up start/stop/clear/capture event type */
#define IS_VALID_HW_STA_STP_CLR_CAP_TYPE(x) \
    ((Timer6HwTrigAos0 == (x)) ||           \
     (Timer6HwTrigAos1 == (x)) ||           \
     (Timer6HwTrigPWMARise == (x)) ||       \
     (Timer6HwTrigPWMAFall == (x)) ||       \
     (Timer6HwTrigPWMBRise == (x)) ||       \
     (Timer6HwTrigPWMBFall == (x)) ||       \
     (Timer6HwTrigTimTriARise == (x)) ||    \
     (Timer6HwTrigTimTriAFall == (x)) ||    \
     (Timer6HwTrigTimTriBRise == (x)) ||    \
     (Timer6HwTrigTimTriBFall == (x)) ||    \
     (Timer6HwTrigEnd == (x)))

/*!< Parameter valid check for timer6 input port type */
#define IS_VALID_INPUT_PORT_TYPE(x) \
    ((Timer6xCHA == (x)) ||         \
     (Timer6xCHB == (x)) ||         \
     (Timer6TrigA == (x)) ||        \
     (Timer6TrigB == (x)))

/*!< Parameter valid check for GenCMP and period register buffer transfer type*/
#define IS_VALID_GCMP_PRD_BUF_TYPE(x)   \
    ((Timer6GcmpPrdSingleBuf == (x)) || \
     (Timer6GcmpPrdDoubleBuf == (x)))

/*!< Parameter valid check for special compare register buffer transfer type */
#define IS_VALID_SPCL_BUF_TYPE(x)    \
    ((Timer6SpclSingleBuf == (x)) || \
     (Timer6SpclDoubleBuf == (x)))

/*!< Parameter valid check for spcl register transfer opportunity type */
#define IS_VALID_SPCL_TRANS_OPT_TYPE(x) \
    ((Timer6SplcOptNone == (x)) ||      \
     (Timer6SplcOptOverFlow == (x)) ||  \
     (Timer6SplcOptUnderFlow == (x)) || \
     (Timer6SplcOptBoth == (x)))

/*!< Parameter valid check for dead time register type */
#define IS_VALID_DEAD_TIME_TYPE(x)  \
    ((Timer6DeadTimUpAR == (x)) ||  \
     (Timer6DeadTimUpBR == (x)) ||  \
     (Timer6DeadTimDwnAR == (x)) || \
     (Timer6DeadTimDwnBR == (x)))

/*!< Parameter valid check for Z Phase input mask periods */
#define IS_VALID_ZPHASE_MASK_PRD(x) \
    ((Timer6ZMaskDis == (x)) ||     \
     (Timer6ZMask4Cyl == (x)) ||    \
     (Timer6ZMask8Cyl == (x)) ||    \
     (Tiemr6ZMask16Cyl == (x)))

/*!< Parameter valid check for event source */
#define IS_VALID_EVENT_SOURCE(x) ((x) <= 511)

/*! TimerA registers reset value */
#define TIMERA_REG_CNTER_RESET_VALUE (0x0000u)
#define TIMERA_REG_GCONR_RESET_VALUE (0x00000100ul)
#define TIMERA_REG_ICONR_RESET_VALUE (0x00000000ul)
#define TIMERA_REG_PCONR_RESET_VALUE (0x00000000ul)
#define TIMERA_REG_BCONR_RESET_VALUE (0x00000000ul)
#define TIMERA_REG_DCONR_RESET_VALUE (0x00000000ul)
#define TIMERA_REG_FCONR_RESET_VALUE (0x00000000ul)
#define TIMERA_REG_VPERR_RESET_VALUE (0x00000000ul)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

