MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_timer6.c
/*******************************************************************************
 * \brief   Port input config(Trig)
 *
 *
 * \param   [in]  TMR6x             Timer6 unit
 * \param   [in]  pstcTimer6PortInputCfg   Point Input Config Pointer
 *
 * \retval  Ok:  Set successfully
 * \retval  ErrorInvalidParameter: Provided parameter is not valid
 *
 ******************************************************************************/
en_result_t Timer6_PortInputConfig(M4_TMR6_TypeDef *TMR6x, const stc_timer6_port_input_cfg_t *pstcTimer6PortInputCfg)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));

    if (NULL == pstcTimer6PortInputCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        switch (pstcTimer6PortInputCfg->enPortSel)
        {
        case Timer6xCHA:
            TMR6x->PCONR_f.CAPMDA = pstcTimer6PortInputCfg->enPortMode;
            TMR6x->FCONR_f.NOFIENGA = pstcTimer6PortInputCfg->bFltEn;
            TMR6x->FCONR_f.NOFICKGA = pstcTimer6PortInputCfg->enFltClk;
            break;

        case Timer6xCHB:
            TMR6x->PCONR_f.CAPMDB = pstcTimer6PortInputCfg->enPortMode;
            TMR6x->FCONR_f.NOFIENGB = pstcTimer6PortInputCfg->bFltEn;
            TMR6x->FCONR_f.NOFICKGB = pstcTimer6PortInputCfg->enFltClk;
            break;

        case Timer6TrigA:
            TMR6x->FCONR_f.NOFIENTA = pstcTimer6PortInputCfg->bFltEn;
            TMR6x->FCONR_f.NOFICKTA = pstcTimer6PortInputCfg->enFltClk;
            break;

        case Timer6TrigB:
            TMR6x->FCONR_f.NOFIENTB = pstcTimer6PortInputCfg->bFltEn;
            TMR6x->FCONR_f.NOFICKTB = pstcTimer6PortInputCfg->enFltClk;
            break;

        default:
            enRet = ErrorInvalidParameter;
            break;
        }
    }
    return enRet;
}

/*******************************************************************************
 * \brief   Timer6 Output Port config
 *
 *
 * \param   [in]  TMR6x                    Timer6 unit
 * \param   [in]  enTimer6PWMPort          Timer6 Port(PWMA/PWMB)
 * \param   [in]  pstcTimer6PortOutCfg     timer6 Port Config Pointer
 *
 * \retval  Ok:  Set successfully
 * \retval  ErrorInvalidParameter: Provided parameter is not valid
 *
 ******************************************************************************/
en_result_t Timer6_PortOutputConfig(M4_TMR6_TypeDef *TMR6x,
                                    en_timer6_chx_port_t enTimer6PWMPort,
                                    const stc_timer6_port_output_cfg_t *pstcTimer6PortOutCfg)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_TIMER6_OUTPUT_PORT(enTimer6PWMPort));

    if (NULL == pstcTimer6PortOutCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        switch (enTimer6PWMPort)
        {
        case Timer6PWMA:
            TMR6x->PCONR_f.CAPMDA = pstcTimer6PortOutCfg->enPortMode;
            TMR6x->PCONR_f.STACA = pstcTimer6PortOutCfg->enStaOut;
            TMR6x->PCONR_f.STPCA = pstcTimer6PortOutCfg->enStpOut;
            TMR6x->PCONR_f.STASTPSA = pstcTimer6PortOutCfg->enStaStp;
            TMR6x->PCONR_f.CMPCA = pstcTimer6PortOutCfg->enCmpc;
            TMR6x->PCONR_f.PERCA = pstcTimer6PortOutCfg->enPerc;
            TMR6x->PCONR_f.OUTENA = pstcTimer6PortOutCfg->bOutEn;
            TMR6x->PCONR_f.EMBVALA = pstcTimer6PortOutCfg->enDisVal;
            break;

        case Timer6PWMB:
            TMR6x->PCONR_f.CAPMDB = pstcTimer6PortOutCfg->enPortMode;
            TMR6x->PCONR_f.STACB = pstcTimer6PortOutCfg->enStaOut;
            TMR6x->PCONR_f.STPCB = pstcTimer6PortOutCfg->enStpOut;
            TMR6x->PCONR_f.STASTPSB = pstcTimer6PortOutCfg->enStaStp;
            TMR6x->PCONR_f.CMPCB = pstcTimer6PortOutCfg->enCmpc;
            TMR6x->PCONR_f.PERCB = pstcTimer6PortOutCfg->enPerc;
            TMR6x->PCONR_f.OUTENB = pstcTimer6PortOutCfg->bOutEn;
            TMR6x->PCONR_f.EMBVALB = pstcTimer6PortOutCfg->enDisVal;
            break;

        default:
            enRet = ErrorInvalidParameter;
            break;
        }
    }
    return enRet;
}

/*******************************************************************************
 * \brief   Timer6 unit Set DeadTime Register Value(for PWM output)
 *
 *
 * \param   [in]  TMR6x              Timer6 unit
 * \param   [in]  enTimer6DTReg      DeadTime Register name
 * \param   [in]  u16DTValue         DeadTime Register value
 *
 * \retval  Ok:  Set Successfully
 * \retval  ErrorInvalidParameter: Provided parameter is not valid
 *
 ******************************************************************************/
en_result_t Timer6_SetDeadTimeValue(M4_TMR6_TypeDef *TMR6x, en_timer6_dead_time_reg_t enTimer6DTReg, uint16_t u16DTValue)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_DEAD_TIME_TYPE(enTimer6DTReg));

    switch (enTimer6DTReg)
    {
    case Timer6DeadTimUpAR:
        TMR6x->DTUAR = u16DTValue;
        break;
    case Timer6DeadTimUpBR:
        TMR6x->DTUBR = u16DTValue;
        break;
    case Timer6DeadTimDwnAR:
        TMR6x->DTDAR = u16DTValue;
        break;
    case Timer6DeadTimDwnBR:
        TMR6x->DTDBR = u16DTValue;
        break;
    default:
        enRet = ErrorInvalidParameter;
        break;
    }

    return enRet;
}

/*******************************************************************************
 * \brief   Config DeadTime function
 *
 *
 * \param   [in]  TMR6x               Timer6 unit
 * \param   [in]  pstcTimer6DTCfg     Timer6 dead time config pointer
 *
 * \retval  Ok:  Set Successfully
 * \retval  ErrorInvalidParameter: Provided parameter is not valid
 *
 ******************************************************************************/
en_result_t Timer6_ConfigDeadTime(M4_TMR6_TypeDef *TMR6x, const stc_timer6_deadtime_cfg_t *pstcTimer6DTCfg)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));

    if (NULL == pstcTimer6DTCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        TMR6x->DCONR_f.SEPA = pstcTimer6DTCfg->bEnDtEqualUpDwn;
        TMR6x->DCONR_f.DTBENU = pstcTimer6DTCfg->bEnDtBufUp;
        TMR6x->DCONR_f.DTBEND = pstcTimer6DTCfg->bEnDtBufDwn;
        TMR6x->DCONR_f.DTCEN = pstcTimer6DTCfg->bEnDeadtime;
    }
    return enRet;
}

